benchmarks/results/auth-serialization/test-me/baseline/wrk2-logs/run_1_1705_1800.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 6.703ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.341ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.73ms    1.16ms   8.68ms   62.10%
    Req/Sec   311.88     39.86   461.00     75.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.93ms
 75.000%    5.53ms
 90.000%    6.16ms
 99.000%    7.26ms
 99.900%    7.94ms
 99.990%    8.50ms
 99.999%    8.69ms
100.000%    8.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.139     0.000000            1         1.00
       3.113     0.100000         1207         1.11
       3.479     0.200000         2402         1.25
       3.851     0.300000         3601         1.43
       4.599     0.400000         4806         1.67
       4.935     0.500000         6012         2.00
       5.043     0.550000         6604         2.22
       5.155     0.600000         7209         2.50
       5.283     0.650000         7810         2.86
       5.403     0.700000         8415         3.33
       5.531     0.750000         9011         4.00
       5.603     0.775000         9301         4.44
       5.691     0.800000         9611         5.00
       5.799     0.825000         9899         5.71
       5.911     0.850000        10199         6.67
       6.035     0.875000        10501         8.00
       6.087     0.887500        10648         8.89
       6.159     0.900000        10798        10.00
       6.235     0.912500        10949        11.43
       6.315     0.925000        11099        13.33
       6.407     0.937500        11251        16.00
       6.463     0.943750        11324        17.78
       6.547     0.950000        11398        20.00
       6.647     0.956250        11473        22.86
       6.727     0.962500        11549        26.67
       6.831     0.968750        11623        32.00
       6.879     0.971875        11661        35.56
       6.927     0.975000        11697        40.00
       6.971     0.978125        11734        45.71
       7.019     0.981250        11773        53.33
       7.087     0.984375        11810        64.00
       7.131     0.985938        11830        71.11
       7.179     0.987500        11848        80.00
       7.227     0.989062        11865        91.43
       7.287     0.990625        11886       106.67
       7.339     0.992188        11903       128.00
       7.375     0.992969        11912       142.22
       7.399     0.993750        11923       160.00
       7.435     0.994531        11931       182.86
       7.471     0.995313        11940       213.33
       7.535     0.996094        11952       256.00
       7.559     0.996484        11954       284.44
       7.587     0.996875        11959       320.00
       7.655     0.997266        11964       365.71
       7.695     0.997656        11968       426.67
       7.723     0.998047        11973       512.00
       7.759     0.998242        11975       568.89
       7.783     0.998437        11978       640.00
       7.843     0.998633        11980       731.43
       7.895     0.998828        11982       853.33
       7.947     0.999023        11985      1024.00
       7.951     0.999121        11986      1137.78
       8.031     0.999219        11987      1280.00
       8.051     0.999316        11988      1462.86
       8.055     0.999414        11989      1706.67
       8.135     0.999512        11991      2048.00
       8.135     0.999561        11991      2275.56
       8.147     0.999609        11992      2560.00
       8.147     0.999658        11992      2925.71
       8.319     0.999707        11993      3413.33
       8.495     0.999756        11994      4096.00
       8.495     0.999780        11994      4551.11
       8.495     0.999805        11994      5120.00
       8.495     0.999829        11994      5851.43
       8.503     0.999854        11995      6826.67
       8.503     0.999878        11995      8192.00
       8.503     0.999890        11995      9102.22
       8.503     0.999902        11995     10240.00
       8.503     0.999915        11995     11702.86
       8.687     0.999927        11996     13653.33
       8.687     1.000000        11996          inf
#[Mean    =        4.728, StdDeviation   =        1.158]
#[Max     =        8.680, Total count    =        11996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 6.71MB read
Requests/sec:    599.94
Transfer/sec:    229.08KB